product = {
        "Молочные": [
            {"name": "Сметана", "калории": 206, "белки": 2.5, "жиры": 20, "углеводы": 3.4},
            {"name": "Молоко", "калории": 49, "белки": 3, "жиры": 2, "углеводы": 4.7},
            {"name": "Снежок", "калории": 78, "белки": 2.8, "жиры": 11, "углеводы": 11},
            {"name": "Йогурт", "калории": 67, "белки": 2.8, "жиры": 4, "углеводы": 4.2},
            {"name": "Сыр", "калории": 80.6, "белки": 11, "жиры": 2.5, "углеводы": 3.8}
        ],
        "Сладости": [
            {"name": "Халва", "калории": 509.6, "белки": 12.7, "жиры": 29.9, "углеводы": 50.6},
            {"name": "Шоколад", "калории": 720.5, "белки": 5, "жиры": 73.6, "углеводы": 10.8},
            {"name": "Конфеты", "калории": 245.1, "белки":  6.7, "жиры": 2.2, "углеводы": 49.3},
            {"name": "Нутелла", "калории": 551.9, "белки": 21.9, "жиры": 44.2, "углеводы": 16.3},
            {"name": "Печеньки", "калории": 97.4, "белки": 9.8, "жиры": 1.5,  "углеводы": 16.7},
        ],
        "Овощи": [
            {"name": "Тыква", "калории": 27, "белки": 1, "жиры": 0.5, "углеводы": 3.9},
            {"name": "Морковь", "калории": 35, "белки": 1.3, "жиры": 0.1,  "углеводы": 6.9},
            {"name": "Кабачок", "калории": 22, "белки": 1, "жиры": 0.1, "углеводы": 4.4},
            {"name": "Помидор", "калории": 23, "белки": 1.2, "жиры": 0.2, "углеводы": 4},
            {"name": "Огурец", "калории": 15, "белки": 0.7, "жиры": 0.1, "углеводы": 3.1},
        ],
        "Фрукты": [
            {"name": "Яблоко", "калории": 47, "белки": 0.4, "жиры": 0.4, "углеводы": 9.8},
            {"name": "Банан", "калории": 96, "белки": 1.5, "жиры": 0.5, "углеводы": 21},
            {"name": "Киви", "калории": 52, "белки": 0.3, "жиры": 0.1, "углеводы": 11.8},
            {"name": "Манго", "калории": 60, "белки": 0.8, "жиры": 0.4, "углеводы": 13.4},
            {"name": "Мандарин", "калории": 43 , "белки": 0.9, "жиры": 0.2, "углеводы": 8.1},
        ],
        "Мясо": [
            {"name": "Рыба", "калории": 59.8, "белки": 8.8, "жиры": 1, "углеводы": 3.8},
            {"name": "Свинина", "калории": 357.4, "белки": 15, "жиры": 32.9, "углеводы": 0.4},
            {"name": "Говядина", "калории": 218, "белки": 18.6, "жиры": 16, "углеводы": 0},
            {"name": "Курица", "калории": 167, "белки": 19.5, "жиры": 9.9, "углеводы": 0},
            {"name": "Баранина", "калории": 209, "белки": 15.6, "жиры": 16.3, "углеводы": 0},
        ]
    }
